// // // var years = prompt('How old are you?', "");
// // // alert ('You are ' + years + ' years old!');

// // // promt - состоит из 2х частей
// // // 1-я часть - вопрос
// // // 2-я часть - ответ по умолчанию 
// // // prompt - запоминает данные, для дальнейшей обработки

// // // alert('Welcome, guest'); 
// // // модальное окно - системное - дизайн изменить нельзя

// // // var result = prompt ('Сколько будет 2+2?', "");
// // // result = result+2;
// // // alert ('Вам ' + result + ' лет!');

// // var result = prompt ('Сколько будет 2+2?', "");

// // var msg;
// // if(result == 4) {
// //     msg = 'Верно';
// // } else {
// //     msg = 'Неверно';
// // }

// // alert(msg);

//             // ---------------------------------------------

//                                 // HOMEWORK
//             // Сделайте скрипт который запрашивает у пользователя ввести ИМЯ и ФАМИЛИЯ, 
//             // вы должны получить эти данные и вывести это на консоли

// var FirstName = prompt('What is your name?', "");
// var SecondName = prompt('What is your surname?', "");

// alert('You are Atabek Iskandarov');
// alert("Welcome, mr. Atabek Iskandarov"); 
//             // ---------------------------------------------

//             // Сделайте скрипт который запрашивает ввести два числа
//             // и вывести сумму этих двух чисел

// let a = +prompt("Введите первое число", "");
// let b = +prompt("Введите второе число", "");
            
// alert (a+b);

//             // Сделайте скрипт который запрашивает ввести два числа 
//             // и вывести умножение этих чисел  

// let x = prompt("Введите первое число", "");
// let y = prompt("Введите первое число", "");

// alert (x * y);



